tap "esolitos/ipa"
tap "gcenx/wine"
tap "homebrew/services"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12", link: false
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76", link: true
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Validating, recursive, caching DNS resolver
brew "unbound"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# Simple terminal UI for git commands
brew "lazygit"
# Mac App Store command-line interface
brew "mas"
# QUIC transport protocol implementation
brew "mvfst"
# Open source relational database management system
brew "mysql"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node@20", link: true
# Modern shell for the GitHub era
brew "nushell"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Fast, disk space efficient package manager
brew "pnpm"
# Cross-platform library for audio I/O
brew "portaudio"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Tool Command Language
brew "tcl-tk", link: false
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Watch files and take action when they change
brew "watchman"
# Command-line client for WebSockets
brew "websocat"
# Internet file retriever
brew "wget"
# Automatic workarounds for problems in Wine
brew "winetricks"
# JavaScript package manager
brew "yarn", link: false
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Non-interactive ssh password auth Files
brew "esolitos/ipa/sshpass"
# Android SDK component
cask "android-platform-tools"
# Free and open-source web browser
cask "chromium"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
cask "warp"
cask "cursor"
cask "arc"
cask "postman"
cask "slack"
cask "sequel-ace"
cask "orbstack"
cask "amazon-q"
cask "scroll-reverser"
# Text editor for code, markup and prose
cask "sublime-text"
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "anbuselvanrocky.bootstrap5-vscode"
vscode "anysphere.pyright"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-mysql-client2"
vscode "dannysteenman.cloudformation-yaml-snippets"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "glenn2223.live-sass"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "innwin.i18n-arb-editor"
vscode "kevinrose.vsc-python-indent"
vscode "localizely.flutter-intl"
vscode "mathiasfrohlich.kotlin"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "naumovs.color-highlight"
vscode "njpwerner.autodocstring"
vscode "openai.chatgpt"
vscode "pjmiravalle.terraform-advanced-syntax-highlighting"
vscode "prisma.prisma"
vscode "ralfzhang.filetemplate"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "saoudrizwan.claude-dev"
vscode "shalldie.background"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-manifest-yaml"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "wayou.vscode-icons-mac"
vscode "wholroyd.jinja"
vscode "zenor.makefile-creator"
